payload.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" flexmonster="true">
    <SOAP-ENV:Body>
        <Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
            <Command>
                <Statement><![CDATA[with set [measureSet] as '{[Measures].[VALUE_THB]}' set [TIMEFilterSet] as '{[TIME].[All TIMEs].[2020], [TIME].[All TIMEs].[2021], [TIME].[All TIMEs].[2022], [TIME].[All TIMEs].[2023], [TIME].[All TIMEs].[2024], [TIME].[All TIMEs].[2025]}' set [TIMECalculatedSet] as '{[TIME].[All TIMEs].[(Total)]}' set [set_2_set] as '{Hierarchize(Distinct(Union([TIMEFilterSet], [TIMECalculatedSet])))}' set [columnHierarchiesSet] as '{Filter([set_2_set], not (isEmpty([Measures].[VALUE_THB])))}' set [columnSet] as '{Crossjoin([columnHierarchiesSet], [measureSet])}' set [set_0_set] as '{Union({[COUNTRY].[All COUNTRYs]}, [COUNTRY].levels(1).AllMembers)}' set [rowHierarchiesSet] as '{Filter([set_0_set], not (isEmpty([Measures].[VALUE_THB])))}' set [rowSet] as '{[rowHierarchiesSet]}' member [TIME].[All TIMEs].[(Total)] as 'Aggregate({[TIME].[All TIMEs].[2020],[TIME].[All TIMEs].[2021],[TIME].[All TIMEs].[2022],[TIME].[All TIMEs].[2023],[TIME].[All TIMEs].[2024],[TIME].[All TIMEs].[2025]})' Select NON EMPTY [columnSet] DIMENSION PROPERTIES PARENT_UNIQUE_NAME, HIERARCHY_UNIQUE_NAME, MEMBER_TYPE ON COLUMNS , NON EMPTY [rowSet] DIMENSION PROPERTIES PARENT_UNIQUE_NAME, HIERARCHY_UNIQUE_NAME, MEMBER_TYPE ON ROWS FROM [TRADE]  CELL PROPERTIES VALUE]]></Statement>
            </Command>
            <Properties>
                <PropertyList flexmonster="true">
                    <DataSourceInfo>Provider=Mondrian;DataSource=TISTradeThaiExport</DataSourceInfo>
                    <Catalog>TRADE</Catalog>
                    <AxisFormat>TupleFormat</AxisFormat>
                    <Content>Data</Content>
                    <Format>Multidimensional</Format>
                </PropertyList>
            </Properties>
        </Execute>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>